{
  "indexable": true,
  "title": "Homogeneous length functions on groups",
  "authors": [
    {
      "user": {
        "userName": "D.H.J. Polymath"
      }
    }
  ],
  "abstractText": "A #T_plf defined on an arbitrary #(T_group, 'group' ) $G = (G,\\cdot,e,(\\,)^{-1})$ is a map ${\\ell}: G \\to [0,+\\infty)$ obeying ${\\ell({e})}=0$, the symmetry property ${\\ell({x^{-1}})} = {\\ell({x})}$, and the triangle inequality ${\\ell({xy})} \\leq {\\ell({x})} + {\\ell({y})}$ for all $x,y \\in G$. We consider pseudo-length functions which saturate the triangle inequality whenever $x=y$, or equivalently those that are *homogeneous* in the sense that ${\\ell({x^n})} = n\\,{\\ell({x})}$ for all $n\\in{\\mathbb{N}}$. We show that this implies that ${\\ell({[x,y]})}=0$ for all $x,y \\in G$. This leads to a classification of such pseudo-length functions as pullbacks from embeddings into a #(T_banach_space, 'Banach space'). We also obtain a quantitative version of our main result which allows for defects in the triangle inequality or the #T_homogeneity property.",
  "beliefset": "#.2wK/B.default",
  "content": "A #T_plf defined on an arbitrary #(T_group, 'group' ) $G = (G,\\cdot,e,(\\,)^{-1})$ is a map ${\\ell}: G \\to [0,+\\infty)$ obeying ${\\ell({e})}=0$, the symmetry property ${\\ell({x^{-1}})} = {\\ell({x})}$, and the triangle inequality ${\\ell({xy})} \\leq {\\ell({x})} + {\\ell({y})}$ for all $x,y \\in G$. We consider pseudo-length functions which saturate the triangle inequality whenever $x=y$, or equivalently those that are *homogeneous* in the sense that ${\\ell({x^n})} = n\\,{\\ell({x})}$ for all $n\\in{\\mathbb{N}}$. We show that this implies that ${\\ell({[x,y]})}=0$ for all $x,y \\in G$. This leads to a classification of such pseudo-length functions as pullbacks from embeddings into a #(T_banach_space, 'Banach space'). We also obtain a quantitative version of our main result which allows for defects in the triangle inequality or the #T_homogeneity property.\n\nIntroduction\n============\n\nLet $G = (G, \\cdot, e, (\\,)^{-1})$ be a group (written multiplicatively, with identity element $e$).  #(T_plf, EXPAND)\nIf in addition we have ${\\ell({x})}>0$ for all $x \\in G \\setminus \\{e\\}$, we say that ${\\ell}$ is a *#T_length_function*. By setting $d(x,y) \\coloneqq {\\ell({x^{-1}y})}$, it is easy to see that #(P.8yN, EXPAND|LC)\n\nFrom the above properties it is clear that one has the upper bound #(P.Ro4, EXPAND)\nLet us say that a pseudo-length function ${\\ell}: G\\to [0,+\\infty)$ is <i> #(T_homogeneity, 'homogeneous') </i> if equality is always attained here, in that one has\n\n$${\\ell({x^n})} = |n| \\, {\\ell({x})}$$ \n\nfor all $x \\in G$ and any $n \\in {\\mathbb{Z}}$. Using the axioms of a pseudo-length function, it is not difficult to show that the #(P.zMa, EXPAND) See #(R.Ro4, 'GK Lemma 1').\n\n\nIf one has a real or complex #(T_banach_space, 'banach space') $\\mathbb{B} = (\\mathbb{B},\\| \\, \\|)$, and \n$\\phi: G \\to \\mathbb{B}$ is any #(T_group_homomorphism, 'homomorphism') from $G$ to $\\mathbb{B}$ \n(viewing the latter as a group in additive notation), then the function \n${\\ell}: G \\to [0,+\\infty)$ defined by ${\\ell({x})} \\coloneqq \\| \\phi(x) \\|$ is easily #(P.zDY, 'verified') to be a #T_hplf. Furthermore, #(P.859, EXPAND) For instance, the function ${\\ell({ (n, m) })} \\coloneqq |n + \\sqrt{2} m|$ is a length function on ${\\mathbb{Z}}^2$, where in this case \n$\\mathbb{B} \\coloneqq {\\mathbb{R}}$ and $\\phi((n,m)) \\coloneqq n  + \\sqrt{2} m$. On the other \nhand, one can easily locate many length functions that are not homogeneous, for instance by taking the square root of the length function just constructed.\n\nThe main result of this paper is that such Banach space constructions are in fact the *only* way to generate homogeneous (pseudo-)length functions.\n\n> #P.RGo : Given a group $G$, let ${\\ell}: G \\to [0,+\\infty)$ be a #T_hplf. #(P.RGo, EXPAND)\n\nWe derive #P.RGo from a more quantitative result bounding the pseudo-length of a commutator \n\n$$[x,y] \\coloneqq xyx^{-1}y^{-1};$$ \n\nsee #P.8N2 below. Our arguments are elementary, relying on directly applying the axioms of a homogeneous length function to various carefully chosen words in $x$ and $y$, and repeatedly taking an asymptotic limit $n \\to \\infty$ to dispose of error terms that arise in the estimates obtained in this fashion.\n\nAn additional advantage of quantifying #P.RGo in #P.8N2 is that one can derive from the latter proposition a “quasified” version of #P.RGo\n\nFinally, as one quick corollary of #P.RGo, we obtain the following characterization of the groups that admit homogeneous length functions.\n\n#P.6Xg : #(P.6Xg, EXPAND)\n\nExamples and approaches\n-----------------------\n\nWe now make some remarks to indicate the nontriviality of #P.RGo. #P.6Xg implies that there are no non-abelian groups with homogeneous length functions. Whether or not such a striking geometric rigidity phenomenon holds was previously unknown to experts. Moreover, the corollary fails to hold if one or more of the precise conditions in the theorem are weakened. For instance, such length functions indeed exist (i) on non-abelian monoids, and (ii) on balls of finite radius in free groups. We explain these two cases further in a later section.\n\nGiven these cases, one could *a priori* ask if every non-abelian group admits a homogeneous length function. This is not hard to disprove; here are two examples.\n\nIf $G$ is nilpotent of nilpotency class two (e.g., the Heisenberg group), then $[x,y]^{n^2} = [x^n,y^n]$ for all $x,y \\in G$ and integers \n$n \\geq0$ since the map $(g,h) \\mapsto [g,h]$ is now a bihomomorphism $G \\times G \\to [G,G] \\subset Z(G)$. If $[x,y]$ is non-trivial, then any homogeneous length function on $G$ would assign a linearly growing quantity to the right-hand side and a quadratically growing quantity to the left-hand side, which is absurd; thus such groups cannot admit homogeneous length functions. The claim then also follows for nilpotent groups of higher nilpotency class, since they contain subgroups of nilpotency class two.[^2]\n\nAs we explain in Remark \\[Rinv\\], a homogeneous length function ${\\ell}$ induces a *bi-invariant* metric on $G$. Now if $(G, {\\ell})$ is furthermore a connected Lie group, then by [@Milnor Lemma 7.5], $G \\cong K \\times {\\mathbb{R}}^n$ for some compact Lie group $K$ and integer $n \\geq 0$. By , $K$ cannot have torsion elements, hence must be trivial. But then $G$ is abelian.\n\nPrior to #P.6Xg, the above examples left open the question of whether *any* non-abelian group admits a homogeneous length function. One may as well consider groups generated by two non-commuting elements. As a prototypical example, let ${\\mathbf{F}_{2}}$ be the free group on two generators $a,b$. The word length function on ${\\mathbf{F}_{2}}$ is a length function, but it is not homogeneous, since for instance the word length of $(bab^{-1})^n = ba^n b^{-1}$ is $n+2$, which is not a linear function of $n$. It is however the case that the word length of $x^n$ has linear *growth* in $n$ for any non-trivial $x$. Similarly for the Levenshtein distance (edit distance) on ${\\mathbf{F}_{2}}$.\n\nOur initial attempts to construct homogeneous length functions on ${\\mathbf{F}_{2}}$ all failed. Of course, this failure is explained by our main result. However, many of these methods apply under minor weakening of the hypotheses, such as working with monoids rather than groups, or weakening homogeneity. Results in these cases are discussed further in a later section.\n\nFurther motivations\n-------------------\n\nWe next mention some motivations from functional analysis and probability, or more precisely the study of Banach space embeddings. If $G$ is an additive subgroup of a Banach space $\\mathbb{B}$, then clearly the norm on $\\mathbb{B}$ restricts to a homogeneous length function on $G$. In [@CSC; @GK] one can find several equivalent conditions for a given length function on a given group to arise in this way (studied in the broader context of additive mappings and separation theorems in functional analysis); see also [@Niem Theorem 2.10(II)] for an alternative proof. These conditions are summarized in [@KR2]. For instance, given a group $G$ with a length function $\\ell$, there exists an isometric embedding from $G$ to a Banach space $\\mathbb{B}$ with ${\\ell}$ induced from the metric on $\\mathbb{B}$, if and only if $G$ is amenable and ${\\ell({x^2})} = 2 {\\ell({x})}$ for all $x$.\n\nIn view of such equivalences, it is natural to try and characterize the groups possessing a homogeneous length function. This question is answered by #P.6Xg, which shows these are precisely the abelian torsion-free groups.\n\nGroups and semigroups with translation-invariant metrics also naturally arise in probability theory, with the most important ‘normed’ (i.e., homogeneous) examples being Banach spaces [@LT]. Notice however that in certain fundamental stochastic settings, formulating and proving results does not require the full Banach space structure. In this vein, a general variant of the Hoffmann-Jørgensen inequality was shown in [@KR1] in arbitrary metric semigroups – including Banach spaces as well as (non-abelian) compact Lie groups. Similarly in [@KR2], the authors transferred the (sharp) Khinchin–Kahane inequality from Banach spaces to abelian groups $G$ equipped with a homogeneous length function. To explore extensions of these results to the non-abelian setting (e.g., Lie groups with left-invariant metrics), we need to first understand if such objects exist. As explained above, this question was not answered in the literature; but it is now settled by our main result.\n\nFinally, there may also be a relation to the Ribe program [@Naor], which aims to reformulate aspects of Banach space theory in purely metric terms. Indeed, from #P.6Xg we see that a metric space $X$ is isometric to an additive subgroup of a Banach space if and only if there is a group structure on $X$ which makes the metric left-invariant and the length function ${\\ell({ x })} \\coloneqq d(1,x)$ homogeneous.\n\nAcknowledgements\n================\n\nThis project is an online collaboration that originated from a blog post at <https://terrytao.wordpress.com/2017/12/16>, following the model of the “Polymath” projects [@gn]. A full list of participants and their grant acknowledgments may be found at http://michaelnielsen.org/polymath1/index.php?title=linear_norm_grant_acknowledgments. We also thank Michal Doucha for useful references and comments, in particular in bringing the paper [@Niem] to our attention, and the anonymous referee for helpful suggestions.\n\nKey proposition\n===============\n\nThe key proposition used to prove #P.RGo is the following estimate, which can treat a somewhat more general class of functions than homogeneous pseudo-length functions, in which the symmetry hypothesis is dropped and one allows for an error in the #T_homogeneity property, which is now also only claimed for $n=2$.\n\n#P.8N2 Let $G = (G,\\cdot)$ be a group, let $c \\in {\\mathbb{R}}$, and let ${\\ell}: G \\to {\\mathbb{R}}$ be a #(T_qhf, 'function') obeying the following axioms:\n\n-   For any $x,y \\in G$, one has ${\\ell({xy})} \\leq {\\ell({x})}+{\\ell({y})}.$\n\n-   For any $x \\in G$, one has ${\\ell({x^2})} \\geq 2{\\ell({x})} - { c}.$\n\nThen, #(P.8N2, EXPAND)\n\nNotably, we neither assume symmetry ${\\ell({ x^{-1} })} = {\\ell({ x })}$, not even up to a constant, nor ${\\ell({ e })} = 0$ (although \n$0\\leq {\\ell({ e })} \\leq c$ follows from the axioms); we also allow ${\\ell}$ to take on negative values. The reader may however wish to restrict attention to #(T_homogeneity, 'homogeneous') length functions, and set $c=0$ and ${\\ell}\\geq 0$ for a first reading of the arguments below. The factor of $5$ is probably not optimal here, but the crucial feature of the bound for our main application is that the right-hand side vanishes when $c=0$ (the right-hand side is also independent of $x$ and $y$, which we use in other applications).\n\nWe define a <i> #T_slf </i> to be a function ${\\ell}: G \\to {\\mathbb{R}}$ such that for all $x, y\\in G$, \n${\\ell({xy})} \\leq {\\ell({x})} + {\\ell({y})}$. Every #T_plf is a #T_slf. A semi-length function \nthat satisfies for some $c\\in{\\mathbb{R}}$ is called <i> #(T_qhf, 'quasi-homogeneous') </i>.\n\n#P.8Ao Suppose ${\\ell}: G \\to {\\mathbb{R}}$ and there is a constant $k$ such that ${\\ell({xy})} \\leq {\\ell({x})} + {\\ell({y})} + k$ for all $x, y\\in G$. Then the function ${\\ell}'(x) := {\\ell({x})} + k$ is a semi-length function. Further, ${\\ell}'$ satisfies  with $c$ replaced by $c' := k+c$, whenever ${\\ell}$ satisfies  on the nose. Thus #P.8N2 continues to hold if is replaced by the condition ${\\ell({xy})} \\leq {\\ell({x})} + {\\ell({y})} + k$ for all \n$x,y\\in G$, with the bound in the conclusion becoming $5c + 4k$.\n\nWe now turn to the proof. For the remainder of this section, let $G$, $c$, and ${\\ell}$ satisfy the hypotheses of the proposition. Our task is to establish the bound. We shall now use and repeatedly to establish a number of further inequalities relating the semi-lengths ${\\ell({x})}$ of various elements $x$ of $G$, culminating in #P.8N2. Many of our inequalities will involve terms that depend on an auxiliary parameter $n$, but we will be able to eliminate several of them by the device of passing to the limit $n \\to \\infty$. It is because of this device that we are able to obtain a bound whose right-hand side is completely uniform in $x$ and $y$.\n\nFrom the #(T_qhf, 'triangle inequality') and induction we have the upper homogeneity bound #(P.8xA, EXPAND)\nSimilarly, from and induction one has the lower homogeneity bound #(P.zEY, EXPAND). It is convenient to rearrange this latter inequality as #(P.6kM, EXPAND) This inequality, particularly in the asymptotic limit $n \\to \\infty$, will be the principal means by which the hypothesis is employed.\n\nWe remark that by further use of #P.8xA one can also obtain a similar estimate to #P.6kM for natural numbers $n$ that are not powers of two, but the powers of two will suffice for the arguments that follow.\n\n#P.RLa #(P.RLa, EXPAND|HIDE_TVI)\n\n#P.R72 Setting $c=0$, we conclude that #(P.R72, EXPAND) It should not be surprising that this observation is used in the proof of #P.RGo, since it is a simple consequence of that theorem.\n\n#(A_arg13, EXPAND|ARG_TEXT_ONLY)\n\n#P.60d (Splitting Lemma) #(P.60d, EXPAND|HIDE_TVI)\n\n#(A_arg15, EXPAND|ARG_TEXT_ONLY)\n\n#P.63G #(P.63G, EXPAND|HIDE_TVI)\n\n#(A.63G, EXPAND|ARG_TEXT_ONLY)\n\nWe now prove #P.8N2\n\n#(A_arg9, EXPAND|ARG_TEXT_ONLY)\n\nOne can deduce a ‘local’ version of #P.8N2 as follows: notice that the constant $c$ can be described in terms of ${\\ell}$ from , to yield\n\n$${\\ell({ [x,y] })} \\leq 5 \\sup_{z \\in G} \\left( 2 {\\ell({z})} - {\\ell({z^2})} \\right)$$\n\nfor any group $G$ and function ${\\ell}: G \\to {\\mathbb{R}}$ for which this supremum exists, and any $x,y \\in G$. (Both sides are zero when $G$ is a Banach space and ${\\ell}$ is the norm, so equality is obtained in that case.) It is also enough to consider the supremum over the subgroup of $G$ generated by $x$ and $y$ without loss of generality, which may lead to a better bound on ${\\ell({ [x,y] })}$ than taking the supremum over all of $G$. Notice also that the constant $c$ must be non-negative, from and with $x=y=e$: \n\n$$c \\geq 2 {\\ell({e})} - {\\ell({e^2})} = {\\ell({e})} \\geq {\\ell({e^2})} - {\\ell({e})} = 0.$$ \n\nIn fact, this reasoning and our results imply that the only way to get $c=0$ on the right-hand side of is when ${\\ell}$ arises from pulling back the norm of a Banach space $\\mathbb{B}$ along a group homomorphism $G\\to\\mathbb{B}$, or equivalently along a group homomorphism from the torsion-free abelianization of $G$ to $\\mathbb{B}$.\n\nCompleting the proof of #P.RGo\n=========================================\n\nWith #P.8N2 in hand, it is not difficult to conclude the proof of #P.RGo. \n\n#(A_arg6, EXPAND|ARG_TEXT_ONLY)\n\nThis concludes the proof of #P.RGo. Since the homomorphism $\\phi: G \\to \\mathbb{B}$ can only be injective for abelian torsion-free $G$, we obtain the “only if” portion of #P.6Xg. Conversely, if a group $G$ is abelian and torsion-free, by the above constructions it embeds into a real vector space \n$\\mathbb{B} \\coloneqq G \\otimes_{\\mathbb{Z}}{\\mathbb{R}}$; now by Zorn’s lemma $\\mathbb{B}$ has a\nnorm (e.g., consider the $\\ell^1$ norm with respect to a Hamel basis of $\\mathbb{B}$), which restricts to the desired homogeneous length function on $G$. We remark that $G \\otimes_{\\mathbb{Z}}{\\mathbb{R}}$ is the construction of the smallest, ‘enveloping’ vector space containing a copy of the abelian, torsion-free group $G$.\n\nThe above arguments also show that homogeneous pseudo-length functions on $G$ are in bijection with seminorms on the real vector space $G_{\\mathrm{ab},0} \\otimes_{\\mathbb{Z}}{\\mathbb{R}}$, where $G_{\\mathrm{ab},0}$ denotes the torsion-free abelianization of $G$.\n\n[7]:http://matwbn.icm.edu.pl/ksiazki/sm/sm100/sm10013.pdf\n"
}